{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 512,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 4,
      "special": true,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "TIME_DELTA=1": 5,
      "TIME_DELTA=2": 6,
      "TIME_DELTA=3": 7,
      "TIME_DELTA=6": 8,
      "TIME_DELTA=4": 9,
      "BAR_END": 10,
      "BAR_START": 11,
      "TIME_DELTA=5": 12,
      "NOTE_ON=62": 13,
      "NOTE_OFF=62": 14,
      "NOTE_ON=60": 15,
      "NOTE_OFF=60": 16,
      "NOTE_ON=64": 17,
      "NOTE_OFF=64": 18,
      "NOTE_ON=59": 19,
      "NOTE_OFF=59": 20,
      "NOTE_ON=57": 21,
      "NOTE_OFF=57": 22,
      "NOTE_ON=63": 23,
      "NOTE_OFF=63": 24,
      "NOTE_ON=61": 25,
      "NOTE_OFF=61": 26,
      "NOTE_ON=58": 27,
      "NOTE_ON=65": 28,
      "NOTE_OFF=58": 29,
      "NOTE_OFF=65": 30,
      "NOTE_ON=67": 31,
      "NOTE_OFF=67": 32,
      "NOTE_ON=66": 33,
      "NOTE_OFF=66": 34,
      "NOTE_ON=55": 35,
      "NOTE_OFF=55": 36,
      "NOTE_ON=56": 37,
      "NOTE_OFF=56": 38,
      "TRACK_END": 39,
      "TRACK_START": 40,
      "NOTE_ON=69": 41,
      "NOTE_OFF=69": 42,
      "NOTE_ON=68": 43,
      "NOTE_OFF=68": 44,
      "NOTE_ON=71": 45,
      "NOTE_OFF=71": 46,
      "NOTE_ON=54": 47,
      "NOTE_OFF=54": 48,
      "NOTE_ON=70": 49,
      "NOTE_OFF=70": 50,
      "NOTE_ON=72": 51,
      "NOTE_OFF=72": 52,
      "NOTE_ON=52": 53,
      "NOTE_OFF=52": 54,
      "NOTE_ON=53": 55,
      "NOTE_OFF=53": 56,
      "TIME_DELTA=7": 57,
      "NOTE_ON=74": 58,
      "NOTE_OFF=74": 59,
      "TIME_DELTA=9": 60,
      "NOTE_ON=50": 61,
      "NOTE_OFF=50": 62,
      "TIME_DELTA=8": 63,
      "NOTE_ON=73": 64,
      "NOTE_OFF=73": 65,
      "TIME_DELTA=12": 66,
      "NOTE_ON=75": 67,
      "NOTE_OFF=75": 68,
      "NOTE_ON=48": 69,
      "NOTE_OFF=48": 70,
      "NOTE_ON=76": 71,
      "NOTE_OFF=76": 72,
      "INST=0": 73,
      "INST=53": 74,
      "PIECE_START": 75,
      "NOTE_ON=51": 76,
      "NOTE_OFF=51": 77,
      "NOTE_ON=47": 78,
      "NOTE_OFF=47": 79,
      "NOTE_ON=77": 80,
      "NOTE_OFF=77": 81,
      "NOTE_ON=45": 82,
      "NOTE_OFF=45": 83,
      "NOTE_ON=49": 84,
      "NOTE_OFF=49": 85,
      "TIME_DELTA=10": 86,
      "NOTE_ON=43": 87,
      "NOTE_OFF=43": 88,
      "NOTE_ON=46": 89,
      "NOTE_OFF=46": 90,
      "NOTE_ON=78": 91,
      "NOTE_OFF=78": 92,
      "NOTE_ON=79": 93,
      "NOTE_OFF=79": 94,
      "TIME_DELTA=11": 95,
      "NOTE_ON=44": 96,
      "NOTE_OFF=44": 97,
      "NOTE_ON=41": 98,
      "NOTE_OFF=41": 99,
      "NOTE_ON=80": 100,
      "NOTE_OFF=80": 101,
      "NOTE_ON=42": 102,
      "NOTE_OFF=42": 103,
      "NOTE_ON=40": 104,
      "NOTE_OFF=40": 105,
      "NOTE_ON=81": 106,
      "NOTE_OFF=81": 107,
      "NOTE_ON=39": 108,
      "NOTE_OFF=39": 109,
      "NOTE_ON=38": 110,
      "NOTE_OFF=38": 111,
      "NOTE_ON=82": 112,
      "NOTE_OFF=82": 113,
      "DENSITY=4": 114,
      "TIME_DELTA=48": 115,
      "DENSITY=2": 116,
      "DENSITY=6": 117,
      "DENSITY=3": 118,
      "TIME_DELTA=18": 119,
      "TIME_DELTA=14": 120,
      "TIME_DELTA=15": 121,
      "TIME_DELTA=13": 122,
      "NOTE_ON=83": 123,
      "NOTE_OFF=83": 124,
      "DENSITY=1": 125,
      "NOTE_ON=84": 126,
      "NOTE_OFF=84": 127,
      "TIME_DELTA=16": 128,
      "NOTE_OFF=37": 129,
      "NOTE_ON=37": 130,
      "NOTE_ON=36": 131,
      "DENSITY=7": 132,
      "NOTE_OFF=36": 133,
      "TIME_DELTA=24": 134,
      "TIME_DELTA=17": 135,
      "DENSITY=5": 136,
      "DENSITY=8": 137,
      "TIME_DELTA=20": 138,
      "TIME_DELTA=21": 139,
      "DENSITY=9": 140,
      "TIME_DELTA=19": 141,
      "NOTE_ON=86": 142,
      "NOTE_OFF=86": 143,
      "TIME_DELTA=22": 144,
      "NOTE_ON=85": 145,
      "NOTE_OFF=85": 146,
      "DENSITY=0": 147,
      "TIME_DELTA=23": 148,
      "TIME_DELTA=30": 149,
      "TIME_DELTA=36": 150,
      "TIME_DELTA=26": 151,
      "TIME_DELTA=27": 152,
      "TIME_DELTA=25": 153,
      "NOTE_ON=88": 154,
      "NOTE_OFF=88": 155,
      "NOTE_ON=35": 156,
      "NOTE_OFF=35": 157,
      "TIME_DELTA=28": 158,
      "NOTE_OFF=87": 159,
      "NOTE_ON=87": 160,
      "TIME_DELTA=32": 161,
      "TIME_DELTA=33": 162,
      "TIME_DELTA=29": 163,
      "NOTE_ON=89": 164,
      "NOTE_OFF=89": 165,
      "TIME_DELTA=31": 166,
      "NOTE_OFF=34": 167,
      "NOTE_ON=34": 168,
      "TIME_DELTA=34": 169,
      "TIME_DELTA=35": 170,
      "TIME_DELTA=38": 171,
      "NOTE_ON=33": 172,
      "NOTE_OFF=33": 173,
      "TIME_DELTA=39": 174,
      "NOTE_ON=32": 175,
      "NOTE_OFF=32": 176,
      "TIME_DELTA=37": 177,
      "TIME_DELTA=42": 178,
      "TIME_DELTA=46": 179,
      "TIME_DELTA=45": 180,
      "TIME_DELTA=40": 181,
      "TIME_DELTA=43": 182,
      "NOTE_OFF=91": 183,
      "NOTE_ON=91": 184,
      "NOTE_ON=31": 185,
      "NOTE_OFF=31": 186,
      "TIME_DELTA=41": 187,
      "TIME_DELTA=44": 188,
      "NOTE_OFF=90": 189,
      "NOTE_ON=90": 190,
      "NOTE_ON=30": 191,
      "NOTE_OFF=30": 192,
      "TIME_DELTA=47": 193,
      "NOTE_OFF=92": 194,
      "NOTE_ON=92": 195,
      "NOTE_OFF=28": 196,
      "NOTE_ON=28": 197,
      "NOTE_OFF=26": 198,
      "NOTE_ON=26": 199,
      "NOTE_OFF=29": 200,
      "NOTE_ON=29": 201,
      "NOTE_OFF=93": 202,
      "NOTE_ON=93": 203,
      "NOTE_OFF=96": 204,
      "NOTE_ON=96": 205,
      "NOTE_OFF=95": 206,
      "NOTE_ON=95": 207,
      "NOTE_OFF=27": 208,
      "NOTE_ON=27": 209,
      "NOTE_OFF=94": 210,
      "NOTE_ON=94": 211,
      "NOTE_OFF=24": 212,
      "NOTE_OFF=98": 213,
      "NOTE_ON=24": 214,
      "NOTE_ON=98": 215,
      "NOTE_OFF=100": 216,
      "NOTE_OFF=97": 217,
      "NOTE_ON=100": 218,
      "NOTE_ON=97": 219,
      "NOTE_OFF=102": 220,
      "NOTE_OFF=99": 221,
      "NOTE_ON=102": 222,
      "NOTE_ON=99": 223,
      "NOTE_OFF=25": 224,
      "NOTE_ON=25": 225
    },
    "unk_token": "[UNK]"
  }
}